In [8]:
import pandas as pd
student_info = {'Name':['Neha','Shravan','Rakshith','Prarthana','Rohit'],
             'USN':['1JT19CS055','1JT19CS086','1JT19CS069','1JT19CS063','1JT19CS074'],
             'Attendence':[98,94,86,86,80],
               'remarks':['execellent','very good','very good','very good','good']}
df = pd.DataFrame(student_info)
df

        Name         USN  Attendence     remarks
0       Neha  1JT19CS055          98  execellent
1    Shravan  1JT19CS086          94   very good
2   Rakshith  1JT19CS069          86   very good
3  Prarthana  1JT19CS063          86   very good
4      Rohit  1JT19CS074          80        good

In [11]:
df.shape

(5, 4)

In [13]:
df.head(2)

      Name         USN  Attendence     remarks
0     Neha  1JT19CS055          98  execellent
1  Shravan  1JT19CS086          94   very good

In [14]:
df.tail(3)

        Name         USN  Attendence    remarks
2   Rakshith  1JT19CS069          86  very good
3  Prarthana  1JT19CS063          86  very good
4      Rohit  1JT19CS074          80       good

In [15]:
df[2:4]

        Name         USN  Attendence    remarks
2   Rakshith  1JT19CS069          86  very good
3  Prarthana  1JT19CS063          86  very good

In [16]:
df.columns

Index(['Name', 'USN', 'Attendence', 'remarks'], dtype='object')

In [18]:
df['USN']

0    1JT19CS055
1    1JT19CS086
2    1JT19CS069
3    1JT19CS063
4    1JT19CS074
Name: USN, dtype: object

In [20]:
df.Attendence

0    98
1    94
2    86
3    86
4    80
Name: Attendence, dtype: int64

In [21]:
df[['USN','Name']]

          USN       Name
0  1JT19CS055       Neha
1  1JT19CS086    Shravan
2  1JT19CS069   Rakshith
3  1JT19CS063  Prarthana
4  1JT19CS074      Rohit

In [10]:
df['Attendence'].max()

98

In [11]:
df.describe()

       Attendence
count    5.000000
mean    88.800000
std      7.155418
min     80.000000
25%     86.000000
50%     86.000000
75%     94.000000
max     98.000000

In [12]:
df[df['Attendence']>=90]

      Name         USN  Attendence     remarks
0     Neha  1JT19CS055          98  execellent
1  Shravan  1JT19CS086          94   very good

In [22]:
df.set_index('USN')

                 Name  Attendence     remarks
USN
1JT19CS055       Neha          98  execellent
1JT19CS086    Shravan          94   very good
1JT19CS069   Rakshith          86   very good
1JT19CS063  Prarthana          86   very good
1JT19CS074      Rohit          80        good

In [24]:
df

                 Name  Attendence     remarks
USN
1JT19CS055       Neha          98  execellent
1JT19CS086    Shravan          94   very good
1JT19CS069   Rakshith          86   very good
1JT19CS063  Prarthana          86   very good
1JT19CS074      Rohit          80        good

In [25]:
df.loc['1JT19CS063']

Name          Prarthana
Attendence           86
remarks       very good
Name: 1JT19CS063, dtype: object

In [34]:
df.reset_index

<bound method DataFrame.reset_index of    level_0  index         USN       Name  Attendence     remarks
0        0      0  1JT19CS055       Neha          98  execellent
1        1      1  1JT19CS086    Shravan          94   very good
2        2      2  1JT19CS069   Rakshith          86   very good
3        3      3  1JT19CS063  Prarthana          86   very good
4        4      4  1JT19CS074      Rohit          80        good>

In [35]:
df

   level_0  index         USN       Name  Attendence     remarks
0        0      0  1JT19CS055       Neha          98  execellent
1        1      1  1JT19CS086    Shravan          94   very good
2        2      2  1JT19CS069   Rakshith          86   very good
3        3      3  1JT19CS063  Prarthana          86   very good
4        4      4  1JT19CS074      Rohit          80        good